import java.util.Collections;
import java.util.Scanner;

public class Task07 {
    public static void main(String[] args) {
    /*    Задача 7:
          Въведете 3 променливи от клавиатурата – час (целочислен тип), сума
          пари (число с плаваща запетая), дали съм здрав – булев тип.
        Съставете програма, която взема решения на базата на тези данни по
        следния начин:
        - ако съм болен, няма да излизам
        - ако имам пари, ще си купя лекарства
        - ако нямам – ще стоя вкъщи и ще пия чай
        - ако съм здрав, ще отида на кино с приятели
        - ако имам по-малко от 10 лв, ще отида на кафе.
        Полученото решение покажете като съобщение в конзолата.
    */

        Scanner sc = new Scanner(System.in);
    }
}
